results/MariaDB/KabyLake/throughput/noDyni-select_random_ranges.log
sysbench 1.0.8 (using bundled LuaJIT 2.1.0-beta2)

Running the test with following options:
Number of threads: 1
Initializing random number generator from current time


Initializing worker threads...

Threads started!

SQL statistics:
    queries performed:
        read:                            30082
        write:                           0
        other:                           0
        total:                           30082
    transactions:                        30082  (501.34 per sec.)
    queries:                             30082  (501.34 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          60.0017s
    total number of events:              30082

Latency (ms):
         min:                                  0.52
         avg:                                  1.99
         max:                                  2.82
         95th percentile:                      2.52
         sum:                              59970.48

Threads fairness:
    events (avg/stddev):           30082.0000/0.00
    execution time (avg/stddev):   59.9705/0.00

sysbench 1.0.8 (using bundled LuaJIT 2.1.0-beta2)

Running the test with following options:
Number of threads: 2
Initializing random number generator from current time


Initializing worker threads...

Threads started!

SQL statistics:
    queries performed:
        read:                            752072
        write:                           0
        other:                           0
        total:                           752072
    transactions:                        752072 (12534.04 per sec.)
    queries:                             752072 (12534.04 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          60.0012s
    total number of events:              752072

Latency (ms):
         min:                                  0.06
         avg:                                  0.16
         max:                                  3.29
         95th percentile:                      0.12
         sum:                             119630.03

Threads fairness:
    events (avg/stddev):           376036.0000/346580.00
    execution time (avg/stddev):   59.8150/0.16

sysbench 1.0.8 (using bundled LuaJIT 2.1.0-beta2)

Running the test with following options:
Number of threads: 4
Initializing random number generator from current time


Initializing worker threads...

Threads started!

SQL statistics:
    queries performed:
        read:                            1767392
        write:                           0
        other:                           0
        total:                           1767392
    transactions:                        1767392 (29455.82 per sec.)
    queries:                             1767392 (29455.82 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          60.0003s
    total number of events:              1767392

Latency (ms):
         min:                                  0.08
         avg:                                  0.14
         max:                                  4.62
         95th percentile:                      0.14
         sum:                             238652.37

Threads fairness:
    events (avg/stddev):           441848.0000/238468.34
    execution time (avg/stddev):   59.6631/0.18

sysbench 1.0.8 (using bundled LuaJIT 2.1.0-beta2)

Running the test with following options:
Number of threads: 8
Initializing random number generator from current time


Initializing worker threads...

Threads started!

SQL statistics:
    queries performed:
        read:                            2415620
        write:                           0
        other:                           0
        total:                           2415620
    transactions:                        2415620 (40258.11 per sec.)
    queries:                             2415620 (40258.11 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          60.0021s
    total number of events:              2415620

Latency (ms):
         min:                                  0.08
         avg:                                  0.20
         max:                                 10.67
         95th percentile:                      0.28
         sum:                             477687.74

Threads fairness:
    events (avg/stddev):           301952.5000/107814.02
    execution time (avg/stddev):   59.7110/0.10

sysbench 1.0.8 (using bundled LuaJIT 2.1.0-beta2)

Running the test with following options:
Number of threads: 16
Initializing random number generator from current time


Initializing worker threads...

Threads started!

SQL statistics:
    queries performed:
        read:                            2553046
        write:                           0
        other:                           0
        total:                           2553046
    transactions:                        2553046 (42548.84 per sec.)
    queries:                             2553046 (42548.84 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          60.0016s
    total number of events:              2553046

Latency (ms):
         min:                                  0.08
         avg:                                  0.38
         max:                                 16.12
         95th percentile:                      0.57
         sum:                             957766.01

Threads fairness:
    events (avg/stddev):           159565.3750/37372.80
    execution time (avg/stddev):   59.8604/0.03

sysbench 1.0.8 (using bundled LuaJIT 2.1.0-beta2)

Running the test with following options:
Number of threads: 32
Initializing random number generator from current time


Initializing worker threads...

Threads started!

SQL statistics:
    queries performed:
        read:                            3007449
        write:                           0
        other:                           0
        total:                           3007449
    transactions:                        3007449 (50121.39 per sec.)
    queries:                             3007449 (50121.39 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          60.0022s
    total number of events:              3007449

Latency (ms):
         min:                                  0.07
         avg:                                  0.64
         max:                                 44.08
         95th percentile:                      0.90
         sum:                            1917335.65

Threads fairness:
    events (avg/stddev):           93982.7812/14516.69
    execution time (avg/stddev):   59.9167/0.01

sysbench 1.0.8 (using bundled LuaJIT 2.1.0-beta2)

Running the test with following options:
Number of threads: 64
Initializing random number generator from current time


Initializing worker threads...

Threads started!

SQL statistics:
    queries performed:
        read:                            2967162
        write:                           0
        other:                           0
        total:                           2967162
    transactions:                        2967162 (49448.28 per sec.)
    queries:                             2967162 (49448.28 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          60.0042s
    total number of events:              2967162

Latency (ms):
         min:                                  0.07
         avg:                                  1.29
         max:                                 51.74
         95th percentile:                      1.82
         sum:                            3836823.14

Threads fairness:
    events (avg/stddev):           46361.9062/4710.34
    execution time (avg/stddev):   59.9504/0.01

sysbench 1.0.8 (using bundled LuaJIT 2.1.0-beta2)

Running the test with following options:
Number of threads: 128
Initializing random number generator from current time


Initializing worker threads...

Threads started!

SQL statistics:
    queries performed:
        read:                            3089494
        write:                           0
        other:                           0
        total:                           3089494
    transactions:                        3089494 (51481.00 per sec.)
    queries:                             3089494 (51481.00 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          60.0112s
    total number of events:              3089494

Latency (ms):
         min:                                  0.09
         avg:                                  2.48
         max:                                740.46
         95th percentile:                      3.62
         sum:                            7675941.53

Threads fairness:
    events (avg/stddev):           24136.6719/3591.24
    execution time (avg/stddev):   59.9683/0.01